# 데이터프레임 : 2차원 구조(행, 열) - 엑셀

In [3]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
       'Capital': ['Brussels', 'New Delhi', 'Brazilia'],
        'Population': [14143214, 1341234, 12535121]}
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brazilia'],
 'Population': [14143214, 1341234, 12535121]}

In [4]:
# data 딕셔너리를 판다스로 만들기
import pandas as pd
import numpy as np
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])

df

   Country    Capital  Population
0  Belgium   Brussels    14143214
1    India  New Delhi     1341234
2   Brazil   Brazilia    12535121

# iloc : 행, 열 번호로 데이터 찾기

In [5]:
df.iloc[1, 1:3]

Capital       New Delhi
Population      1341234
Name: 1, dtype: object

# loc : 행, 열 이름으로 데이터 찾기

In [6]:
df.loc[0, 'Country']

'Belgium'

In [7]:
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    14143214
1  New Delhi     1341234
2   Brazilia    12535121

In [8]:
df.rename(columns={'Country':'tt'}, inplace=True)
df

        tt    Capital  Population
0  Belgium   Brussels    14143214
1    India  New Delhi     1341234
2   Brazil   Brazilia    12535121

In [9]:
df.merge(['1', '2'])

TypeError: Can only merge Series or DataFrame objects, a <class 'list'> was passed

In [42]:
df

   Country    Capital  Population
0  Belgium   Brussels    14143214
1    India  New Delhi     1341234
2   Brazil   Brazilia    12535121

In [43]:
df.sort_values(by='Population', ascending=False)

   Country    Capital  Population
0  Belgium   Brussels    14143214
2   Brazil   Brazilia    12535121
1    India  New Delhi     1341234

# 판다스 구조 확인

In [101]:
print(df.shape)
df.head() # 상위 5개의 행을 보여준다.

(3, 3)

        tt    Capital  Population
0  Belgium   Brussels    14143214
1    India  New Delhi     1341234
2   Brazil   Brazilia    12535121

In [50]:
df.index[1]

1

In [52]:
df.columns[1]

'Capital'

In [53]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [55]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [66]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrazilia
Population                     28019569
dtype: object

In [69]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    14143214
1        BelgiumIndia          BrusselsNew Delhi    15484448
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrazilia    28019569

In [73]:
df.max()

Country           India
Capital       New Delhi
Population     14143214
dtype: object

In [76]:
df.describe()

         Population
count  3.000000e+00
mean   9.339856e+06
std    6.973518e+06
min    1.341234e+06
25%    6.938178e+06
50%    1.253512e+07
75%    1.333917e+07
max    1.414321e+07

In [77]:
df.mean()

Population    9.339856e+06
dtype: float64

In [78]:
df.median()

Population    12535121.0
dtype: float64

In [83]:
f = lambda x: x*2
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    28286428
1      IndiaIndia  New DelhiNew Delhi     2682468
2    BrazilBrazil    BraziliaBrazilia    25070242